SarveshPatil7/Work-on-TI-F28379D/workspace/LAB7/LAB7_main.c
//#############################################################################
// FILE:   LAB6starter_main.c
//
// TITLE:  Lab Starter
//#############################################################################

// Included Files
#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>
#include <string.h>
#include <math.h>
#include <limits.h>
#include "F28x_Project.h"
#include "driverlib.h"
#include "device.h"
#include "F28379dSerial.h"
#include "LEDPatterns.h"
#include "song.h"
#include "dsp.h"
#include "fpu32/fpu_rfft.h"

#define PI          3.1415926535897932384626433832795
#define TWOPI       6.283185307179586476925286766559
#define HALFPI      1.5707963267948966192313216916398
// BM: for radiant to meters, (this is also the radius of the wheel)
#define RADTOMETER  (0.5/8.414)
// BM: robot width, in meters
#define ROBOT_WIDTH (17.4/100)
// The Launchpad's CPU Frequency set to 200 you should not change this value
#define LAUNCHPAD_CPU_FREQUENCY 200

// ----- code for CAN start here -----
#include "F28379dCAN.h"
//#define TX_MSG_DATA_LENGTH    4
//#define TX_MSG_OBJ_ID         0  //transmit

#define RX_MSG_DATA_LENGTH    8
#define RX_MSG_OBJ_ID_1       1  //measurement from sensor 1
#define RX_MSG_OBJ_ID_2       2  //measurement from sensor 2
#define RX_MSG_OBJ_ID_3       3  //quality from sensor 1
#define RX_MSG_OBJ_ID_4       4  //quality from sensor 2
// ----- code for CAN end here -----


// Interrupt Service Routines predefinition
__interrupt void cpu_timer0_isr(void);
__interrupt void cpu_timer1_isr(void);
__interrupt void cpu_timer2_isr(void);
__interrupt void SWI_isr(void);
// ----- code for CAN start here -----
__interrupt void can_isr(void);
// ----- code for CAN end here -----
__interrupt void SPIB_isr(void);
void setupSpib(void);



// Count variables
uint32_t numTimer0calls = 0;
uint32_t numSWIcalls = 0;
extern uint32_t numRXA;
uint16_t UARTPrint = 0;
uint16_t LEDdisplaynum = 0;
int16_t accelx_raw = 0;
int16_t accely_raw = 0;
int16_t accelz_raw = 0;
int16_t gyrox_raw = 0;
int16_t gyroy_raw = 0;
int16_t gyroz_raw = 0;

float accelx = 0;
float accely = 0;
float accelz = 0;

float gyrox = 0;
float gyroy = 0;
float gyroz = 0;

//int32_t SpibNumCalls = 0;

// ----- code for CAN start here -----
// volatile uint32_t txMsgCount = 0;
// extern uint16_t txMsgData[4];

volatile uint32_t rxMsgCount_1 = 0;
volatile uint32_t rxMsgCount_3 = 0;
extern uint16_t rxMsgData[8];

uint32_t dis_raw_1[2];
uint32_t dis_raw_3[2];
uint32_t dis_1 = 0;
uint32_t dis_3 = 0;

uint32_t quality_raw_1[4];
uint32_t quality_raw_3[4];
float quality_1 = 0.0;
float quality_3 = 0.0;

uint32_t lightlevel_raw_1[4];
uint32_t lightlevel_raw_3[4];
float lightlevel_1 = 0.0;
float lightlevel_3 = 0.0;

uint32_t measure_status_1 = 0;
uint32_t measure_status_3 = 0;

volatile uint32_t errorFlag = 0;
// ----- code for CAN end here -----

// BM: new functions declaration
void init_eQEPs(void);
float readEncLeft(void);
float readEncRight(void);
void setEPWM2A(float controleffort);
void setEPWM2B(float controleffort);
float left_PID(void);
float right_PID(void);
void coordinate_cal(void);
__interrupt void ADCA_ISR (void);

// BM: new global variables
float LeftWheel_rad;
float RightWheel_rad;
float LeftWheel_m;
float RightWheel_m;
float uLeft = 0.0;
float uRight = 0.0;

float PosLeft[2] = {0.0};
float PosRight[2] = {0.0};
float VRightK = 0.0;
float VLeftK = 0.0;
float VRightK_1 = 0.0;
float VLeftK_1 = 0.0;
float VRightK_m;
float VLeftK_m;

// BM: for PID
float Right_E_k = 0;
float Right_I_k = 0;
float Left_E_k = 0;
float Left_I_k = 0;
float Right_E_k_prev = 0;
float Right_I_k_prev = 0;
float Left_E_k_prev = 0;
float Left_I_k_prev = 0;
//float K_p = 3.0;
//float K_i = 25.0;
float V_ref = 0.0;

// BM: for turn control
float turn = 0.0;
float Kp_turn = 3.0;
float e_turn = 0.0;

// BM: labview controller global variables
float printLV3 = 0;
float printLV4 = 0;
float printLV5 = 0;
float printLV6 = 0;
float printLV7 = 0;
float printLV8 = 0;
float x = 0;
float y = 0;
float bearing = 0;
extern uint16_t NewLVData;
extern float fromLVvalues[LVNUM_TOFROM_FLOATS];
extern LVSendFloats_t DataToLabView;
extern char LVsenddata[LVNUM_TOFROM_FLOATS*4+2];
extern uint16_t newLinuxCommands;
extern float LinuxCommands[CMDNUM_FROM_FLOATS];

// BM: new global variables for position calculating
float theta_avg = 0.0;
float theta_avg_dot = 0.0;
float x_dot = 0.0;
float y_dot = 0.0;
float x_dot_past = 0.0;
float y_dot_past = 0.0;

// BM: new global variables for wall tracking
uint16_t right_wall_track = 1;
float Kp_right = 0.0003;
float Kp_front = 0.0005;
float ref_right = 500.0;
float ref_front = 1400.0;
float track_speed = 0.25;
uint32_t distright = 0.0;
uint32_t distfront = 0.0;
uint32_t threshold_1 = 500;
uint32_t threshold_2 = 800;

float shift = 0.6;

// BM: Lab 7 exercise 1 declare
#define XKS_SIZE    22
int16_t adca0result;
int16_t adca1result;
int16_t counter = 0;
float xks0[XKS_SIZE] = {0};
float xks1[XKS_SIZE] = {0};
float yk0 = 0;
float yk1 = 0;
// BM: new b generated by matlab with 21th order FIR with cutoff frequency 75Hz
float b[XKS_SIZE] = { -2.3890045153263611e-03,
                -3.3150057635348224e-03,
                -4.6136191242627002e-03,
                -4.1659855521681268e-03,
                1.4477422497795286e-03,
                1.5489414225159667e-02,
                3.9247886844071371e-02,
                7.0723964095458614e-02,
                1.0453473887246176e-01,
                1.3325672639406205e-01,
                1.4978314227429904e-01,
                1.4978314227429904e-01,
                1.3325672639406205e-01,
                1.0453473887246176e-01,
                7.0723964095458614e-02,
                3.9247886844071371e-02,
                1.5489414225159667e-02,
                1.4477422497795286e-03,
                -4.1659855521681268e-03,
                -4.6136191242627002e-03,
                -3.3150057635348224e-03,
                -2.3890045153263611e-03};

// Needed global Variables
float accelx_offset = 0;
float accely_offset = 0;
float accelz_offset = 0;
float gyrox_offset = 0;
float gyroy_offset = 0;
float gyroz_offset = 0;
float accelzBalancePoint = -.76;
int16 IMU_data[9];
uint16_t temp=0;
int16_t doneCal = 0;
float tilt_value = 0;
float tilt_array[4] = {0, 0, 0, 0};
float gyro_value = 0;
float gyro_array[4] = {0, 0, 0, 0};
float LeftWheel = 0;
float RightWheel = 0;
float LeftWheelArray[4] = {0,0,0,0};
float RightWheelArray[4] = {0,0,0,0};
// Kalman Filter vars
float T = 0.001; //sample rate, 1ms
float Q = 0.01; // made global to enable changing in runtime
float R = 25000;//50000;
float kalman_tilt = 0;
float kalman_P = 22.365;
int16_t SpibNumCalls = -1;
float pred_P = 0;
float kalman_K = 0;
int32_t timecount = 0;
int16_t calibration_state = 0;
int32_t calibration_count = 0;


// BM: for ex3:
float K_1 = -60.0;
float K_2 = -4.5;
float K_3 = -1.1;
float K_4 = -0.1;

