SarveshPatil7/Work-on-TI-F28379D/workspace/LAB7/LAB7_main.c
    //    // Initialize the transmit message object data buffer to be sent
    //    txMsgData[0] = 0x12;
    //    txMsgData[1] = 0x34;
    //    txMsgData[2] = 0x56;
    //    txMsgData[3] = 0x78;


    //    // Loop Forever - A message will be sent once per second.
    //    for(;;)
    //    {
    //
    //        CANsendMessage(CANB_BASE, TX_MSG_OBJ_ID, TX_MSG_DATA_LENGTH, txMsgData);
    //        txMsgCount++;
    //        DEVICE_DELAY_US(1000000);
    //    }


    // ----- code for CAN end here -----

    
    // IDLE loop. Just sit and loop forever (optional):
    while(1)
    {
        if (UARTPrint == 1 ) {
			//serial_printf(&SerialA,"Num Timer2:%ld Num SerialRX: %ld\r\n",CpuTimer2.InterruptCount,numRXA);
			serial_printf(&SerialA,"a:%.3f,%.3f,%.3f  g:%.3f,%.3f,%.3f\r\n",accelx,accely,accelz,gyrox,gyroy,gyroz);
//			serial_printf(&SerialA,"D1 %ld D2 %ld", dis_1, dis_3);
//            serial_printf(&SerialA," St1 %ld St2 %ld\n\r",measure_status_1,measure_status_3);
            // BM: print out the wheel rotation value
            serial_printf(&SerialA,"Left Wheel rad: %.3f Right Wheel rad: %.3f\r\n", LeftWheel_rad, RightWheel_rad);
//            serial_printf(&SerialA,"Left Wheel rad/s: %.3f Right Wheel rad/s: %.3f\r\n", VLeftK, VRightK);
//            serial_printf(&SerialA,"Left Wheel m: %.3f Right Wheel m: %.3f\r\n", LeftWheel_m, RightWheel_m);
//            serial_printf(&SerialA,"Left Wheel m/s: %.3f Right Wheel m/s: %.3f\r\n", VLeftK_m, VRightK_m);

            // BM: print joystick voltages
            serial_printf(&SerialA,"joystick voltage 1: %.3f joystick voltage 2: %.3f\r\n", yk0, yk1);

            // BM: ex2 checking
            serial_printf(&SerialA,"tilt_value: %.3f, gyro_value: %.3f, LeftWheel: %.3f, RightWheel: %.3f\r\n", tilt_value, gyro_value, LeftWheel, RightWheel);

            UARTPrint = 0;
        }
    }
}


// SWI_isr,  Using this interrupt as a Software started interrupt
__interrupt void SWI_isr(void) {

    // These three lines of code allow SWI_isr, to be interrupted by other interrupt functions
	// making it lower priority than all other Hardware interrupts.  
	PieCtrlRegs.PIEACK.all = PIEACK_GROUP12;
    asm("       NOP");                    // Wait one cycle
    EINT;                                 // Clear INTM to enable interrupts



    // Insert SWI ISR Code here.......
    if (NewLVData == 1) {
        NewLVData = 0;
        Segbot_refSpeed = fromLVvalues[0];
        turnrate = fromLVvalues[1];
        printLV3 = fromLVvalues[2];
        printLV4 = fromLVvalues[3];
        printLV5 = fromLVvalues[4];
        printLV6 = fromLVvalues[5];
        printLV7 = fromLVvalues[6];
        printLV8 = fromLVvalues[7];
    }
    if((numSWIcalls%62) == 0) { // change to the counter variable of you selected 4ms. timer
        DataToLabView.floatData[0] = Segbot_refSpeed;
        DataToLabView.floatData[1] = turnrate;
        DataToLabView.floatData[2] = 0;
        DataToLabView.floatData[3] = 0;
        DataToLabView.floatData[4] = 0;
        DataToLabView.floatData[5] = 0;
        DataToLabView.floatData[6] = 0;
        DataToLabView.floatData[7] = 0;
        LVsenddata[0] = '*'; // header for LVdata
        LVsenddata[1] = '$';
        for (int i=0;i<LVNUM_TOFROM_FLOATS*4;i++) {
            if (i%2==0) {
                LVsenddata[i+2] = DataToLabView.rawData[i/2] & 0xFF;
            } else {
                LVsenddata[i+2] = (DataToLabView.rawData[i/2]>>8) & 0xFF;
            }
        }
        serial_sendSCID(&SerialD, LVsenddata, 4*LVNUM_TOFROM_FLOATS + 2);
    }

    //    float WhlDiff;
    //    float turn_angle;
    //    float turn_angle_prev;
    //    float turn;
    //    float errorDiff;
    //    float errorDiff_prev;
    //    float intDiff;
    //    float intDiff_prev;
    //    float vel_WhlDiff;
    //    float vel_WhlDiff_prev;

    PosLeft[0] = LeftWheel;
    PosRight[0] = RightWheel;
    VLeftK = 100 * (PosLeft[0] - PosLeft[1]) + 0.6 * VLeftK_1;
    VRightK = 100 * (PosRight[0] - PosRight[1]) + 0.6 * VRightK_1;
    gyrorate_dot = 100 * (gyro_value - gyro_value_1) + 0.6 * gyrorate_dot_1;

    ubal = -K_1 * tilt_value - K_2 * gyro_value - K_3*((VRightK + VLeftK)/2.0) - K_4 * gyrorate_dot;


    WhlDiff = LeftWheel - RightWheel;

    // BM: cal vel_WhlDiff
    vel_WhlDiff = vel_WhlDiff_prev/3 + 500*(WhlDiff - WhlDiff_prev)/3;


    // BM: cal turn_angle
    turn_angle = turn_angle_prev +  0.002*(turnrate_prev + turnrate);


    // BM: cal errorDiff
    errorDiff = turn_angle - WhlDiff;

    // BM: cal intDiff
    intDiff = intDiff_prev + 0.002*(errorDiff_prev + errorDiff);


    // BM: cal turn
    turn = K_p*errorDiff + K_i*intDiff - K_d*vel_WhlDiff;

    // BM: guard
    if (fabs(turn) > 3.0) {
        vel_WhlDiff = vel_WhlDiff_prev;
        intDiff = intDiff_prev;
        errorDiff = errorDiff_prev;
    }

    // BM: saturate turn
    if (turn > 4.0) {
        turn = 4.0;
    } else if (turn < -4.0) {
        turn = -4.0;
    }

	// BM: cal ForwardBackwardCommand
	eSpeed = (Segbot_refSpeed - (VLeftK + VRightK)/2.0);
	IK_eSpeed = IK_eSpeed_prev + (0.002 * (eSpeed + eSpeed_prev));
	ForwardBackwardCommand = KpSpeed*eSpeed + KiSpeed*IK_eSpeed;

	// BM: IK_eSpeed saturation
	if (fabs(ForwardBackwardCommand) > 3) {
	    IK_eSpeed = IK_eSpeed_prev;
	}

	// BM: ForwardBackwardCommand saturation
	if (ForwardBackwardCommand > 4.0) {
	    ForwardBackwardCommand = 4.0;
	}
	if (ForwardBackwardCommand < -4.0) {
	    ForwardBackwardCommand = -4.0;
	}

	uLeft = ubal/2 + turn - ForwardBackwardCommand;
	uRight = ubal/2 - turn - ForwardBackwardCommand;

	// BM: set the EPWM2A according to the instruction
	setEPWM2A(uRight);   // BM: to control right wheel
	setEPWM2B(-uLeft);   // BM: to control left wheel

	// Saving old variables
    PosLeft[1] = PosLeft[0];
    VLeftK_1 = VLeftK;
    PosRight[1] = PosRight[0];
    VRightK_1 = VRightK;

    gyrorate_dot_1 = gyrorate_dot;
    gyro_value_1 = gyro_value;

    WhlDiff_prev = WhlDiff;

	// BM: update prev values
    errorDiff_prev = errorDiff;
    intDiff_prev = intDiff;
    vel_WhlDiff_prev = vel_WhlDiff;
    turn_angle_prev = turn_angle;
    // BM: update the prev values
	IK_eSpeed_prev = IK_eSpeed;
	eSpeed_prev = eSpeed;



    numSWIcalls++;
    DINT;
}

