SarveshPatil7/Work-on-TI-F28379D/workspace/LAB7/LAB7_main.c
// cpu_timer0_isr - CPU Timer0 ISR
__interrupt void cpu_timer0_isr(void)
{
    CpuTimer0.InterruptCount++;

    numTimer0calls++;

//    if ((numTimer0calls%50) == 0) {
//        PieCtrlRegs.PIEIFR12.bit.INTx9 = 1;  // Manually cause the interrupt for the SWI
//    }

    if ((numTimer0calls%250) == 0) {
        displayLEDletter(LEDdisplaynum);
        LEDdisplaynum++;
        if (LEDdisplaynum == 0xFFFF) {  // prevent roll over exception
            LEDdisplaynum = 0;
        }
    }
	
	
    //Clear GPIO9 Low to act as a Slave Select. Right now, just to scope. Later to select DAN28027 chip
    //GpioDataRegs.GPACLEAR.bit.GPIO9 = 1;
    //    SpibRegs.SPIFFRX.bit.RXFFIL = 2; // Issue the SPIB_RX_INT when two values are in the RX FIFO
    //    SpibRegs.SPITXBUF = 0x4A3B; // 0x4A3B and 0xB517 have no special meaning. Wanted to send
    //    SpibRegs.SPITXBUF = 0xB517; // something so you can see the pattern on the Oscilloscope
    //    SpibRegs.SPIFFRX.bit.RXFFIL = 3; // Issue the SPIB_RX_INT when two values are in the RX FIFO
    //    SpibRegs.SPITXBUF = 0xDA;
    //    SpibRegs.SPITXBUF = 500; // PWM value
    //    SpibRegs.SPITXBUF = 2200; // PWM Value
//    GpioDataRegs.GPCCLEAR.bit.GPIO66 = 1;
//    SpibRegs.SPIFFRX.bit.RXFFIL = 8;
//    SpibRegs.SPITXBUF = 0xBA00;
//    SpibRegs.SPITXBUF = 0x0000;
//    SpibRegs.SPITXBUF = 0x0000;
//    SpibRegs.SPITXBUF = 0x0000;
//    SpibRegs.SPITXBUF = 0x0000;
//    SpibRegs.SPITXBUF = 0x0000;
//    SpibRegs.SPITXBUF = 0x0000;
//    SpibRegs.SPITXBUF = 0x0000;


    if ((numTimer0calls%50) == 0) {
		// Blink LaunchPad Red LED
//		GpioDataRegs.GPBTOGGLE.bit.GPIO34 = 1;
    }


    // Acknowledge this interrupt to receive more interrupts from group 1
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;
}

// cpu_timer1_isr - CPU Timer1 ISR
__interrupt void cpu_timer1_isr(void)
{
    // BM: increment the counter for song
//    song_count++;
    // BM: check counter bounding
//    if (song_count > SONG_LENGTH) {
//        song_count = 0;
//    }

    // BM: set TBPRD for EPwm9Regs
//    EPwm9Regs.TBPRD = songarray[song_count];
    CpuTimer1.InterruptCount++;
}

// cpu_timer2_isr CPU Timer2 ISR
__interrupt void cpu_timer2_isr(void)
{
	// Blink LaunchPad Blue LED
//    GpioDataRegs.GPATOGGLE.bit.GPIO31 = 1;

    CpuTimer2.InterruptCount++;

    if ((CpuTimer2.InterruptCount % 10) == 0) {
//      UARTPrint = 1;
    }

    // BM: calling functions to check wheel rotation angles
    // BM: in rad
//    LeftWheel_rad = readEncLeft();
//    RightWheel_rad = readEncRight();
//    PosLeft[1] = PosLeft[0];
//    PosLeft[0] = LeftWheel_rad;
//    VLeftK = (PosLeft[1] - PosLeft[0]) / 0.004;
//    PosRight[1] = PosRight[0];
//    PosRight[0] = RightWheel_rad;
//    VRightK = (PosRight[1] - PosRight[0]) / 0.004;
//
//    // BM: in m
//    LeftWheel_m = LeftWheel_rad * RADTOMETER;
//    RightWheel_m = RightWheel_rad * RADTOMETER;
//    VLeftK_m = VLeftK * RADTOMETER;
//    VRightK_m = VRightK * RADTOMETER;
//
//    // BM: PID calculation
//    e_turn = VLeftK_m - VRightK_m + turn;
//    uRight = right_PID();
//    uLeft = left_PID();
//    // BM: set the EPWM2A according to the instruction
//    setEPWM2A(uRight);  // BM: to control right wheel
//    setEPWM2B(-uLeft);   // BM: to control left wheel
//
//    // BM: calculating the x, y, and bearing
//    coordinate_cal();
//
//
//    if (NewLVData == 1) {
//        NewLVData = 0;
////        V_ref = fromLVvalues[0];
////        turn = fromLVvalues[1];
////        printLV3 = fromLVvalues[2];
////        printLV4 = fromLVvalues[3];
////        printLV5 = fromLVvalues[4];
////        printLV6 = fromLVvalues[5];
////        printLV7 = fromLVvalues[6];
////        printLV8 = fromLVvalues[7];
//        threshold_1 = fromLVvalues[3];
//        threshold_2 = fromLVvalues[4];
//        Kp_front = fromLVvalues[5];
//        ref_front = fromLVvalues[6];
//
//        Kp_right = fromLVvalues[7];
//        ref_right = fromLVvalues[2];
//    }
//    if((CpuTimer2.InterruptCount%62) == 0) { // change to the counter variable of you selected 4ms. timer
//        DataToLabView.floatData[0] = x;
//        DataToLabView.floatData[1] = y;
////        DataToLabView.floatData[2] = bearing;
//        DataToLabView.floatData[2] = ref_right;
//        DataToLabView.floatData[3] = threshold_1;
//        DataToLabView.floatData[4] = threshold_2;
//        DataToLabView.floatData[5] = Kp_front;
//        DataToLabView.floatData[6] = ref_front;
//        DataToLabView.floatData[7] = Kp_right;
//        LVsenddata[0] = '*'; // header for LVdata
//        LVsenddata[1] = '$';
//        for (int i=0;i<LVNUM_TOFROM_FLOATS*4;i++) {
//            if (i%2==0) {
//                LVsenddata[i+2] = DataToLabView.rawData[i/2] & 0xFF;
//            } else {
//                LVsenddata[i+2] = (DataToLabView.rawData[i/2]>>8) & 0xFF;
//            }
//        }
//        serial_sendSCID(&SerialD, LVsenddata, 4*LVNUM_TOFROM_FLOATS + 2);
//    }

    // BM: ex 8 song turing controller
//    V_ref = track_speed;
//    note = songarray[song_count];
//    turn = (1.0 / (D4NOTE - A5NOTE) * note + (0.5 - D4NOTE / (D4NOTE - A5NOTE))) - shift;

    // BM: wall tracking controller
//    if (measure_status_1 == 0) {
//        distright = dis_1;
//    } else {
//        distright = 1400; // set to max reading if error
//    }
//    if (measure_status_3 == 0) {
//        distfront = dis_3;
//    } else {
//        distfront = 1400; // set to max reading if error
//    }
//
//    // BM: for ex 7 testing
////    turn = Kp_right * (ref_right - distright);
////    V_ref = track_speed;
//
//    if (right_wall_track == 1) {
//        turn = Kp_right * (ref_right - distright);
//        V_ref = track_speed;
//        if (distfront < threshold_1) {
//            right_wall_track = 0;
//        }
//    } else {
//        turn = Kp_front * (ref_front - distfront);
//        V_ref = track_speed;
//        if (distfront > threshold_2) {
//            right_wall_track = 1;
//        }
//    }

	

